export default {
  app: {
    name: 'Задачі'
  },
  cancel: 'Відмінити',
  or: 'або',
  mb: 'МБ',
  fields: {
    name: {
      label: 'Ім’я',
      placeholder: 'Введіть ім’я',
      required: 'Ім’я обов’язкове',
      invalid: 'Недійсне им’я'
    },
    lastname: {
      label: 'Прізвище',
      placeholder: 'Введіть прізвище',
      invalid: 'Недійсне прізвище'
    },
    email: {
      label: 'Ел. пошта',
      placeholder: 'Введіть email',
      invalid: 'Недійсна електронна адреса'
    },
    password: {
      label: 'Пароль',
      placeholder: 'Введіть пароль',
      required: 'Пароль обов’язкове поле',
      min: 'Має бути щонайменше 8 символів'
    }
  },
  role: {
    guest: {
      label: 'Гість'
    },
    maintainer: {
      label: 'Учасник'
    },
    admin: {
      label: 'Адміністратор'
    }
  },
  register: {
    title: 'Зареєструйте безкоштовний обліковий запис',
    already: 'Вже зареєстровані?',
    login: {
      button: 'Увійти',
      text: 'до свого аккаунту'
    },
    submit: 'Зареєструватися',
    success: {
      description: 'Акаунт успішно створено.'
    },
    error: {
      409: 'Акаунт з цим email вже існує.',
      password: 'Пароль занадто слабкий.'
    }
  },
  login: {
    title: 'Увійдіть до свого облікового запису',
    notRegistered: 'Не зареєстровані?',
    signup: {
      button: 'Створіть',
      text: 'акаунт.'
    },
    submit: 'Увійти',
    success: {
      description: 'Успішно авторизовано.'
    },
    error: {
      400: 'Неправильний email або пароль, спробуйте ще раз.',
      401: 'Недійсний email, будь ласка перевірте.',
      password: 'Пароль не відповідає мінімальним вимогам у 8 символів, будь ласка змініть.',
    }
  },
  home: {
    title: 'Головна',
    hero: {
      headline: 'Керуй проєктами',
      title: 'Дошка задач',
      description: 'Гнучкий спосіб керувати вашими проєктами, великими та малими.',
      links: {
        start: 'Почати роботу'
      }
    },
    features: {
      title: 'Основні функції',
      workspaces: {
        title: 'Виділені проєкти',
        desc: 'Організуйте пов\'язані проєкти та членів команди в окремі приватні або спільні середовища.'
      },
      boards: {
        title: 'Дошки Kanban',
        desc: 'Візуалізуйте прогрес робочого процесу за допомогою налаштовуваних стовпців. Перетягуйте задачі між етапами.'
      },
      tasks: {
        title: 'Функціональні задачі (Картки)',
        desc: 'Кожне задачі містить усі необхідні деталі: терміни, пріоритет, статус та пов\'язаний контент.'
      },
      user_assign: {
        title: 'Керування користувачами в РП',
        desc: 'Призначайте ролі (Адміністратор, Член, Гість) та керуйте дозволами на рівні проєкту.'
      },
      task_assign: {
        title: 'Призначення задачам виконавців ',
        desc: 'Швидко додавайте членів команди до конкретних завдань для уточнення відповідальності.'
      },
      attachments: {
        title: 'Вкладення файлів',
        desc: 'Завантажуйте файли та документи безпосередньо в картку задачі для легкого доступу до ресурсів.'
      },
      comments: {
        title: 'Коментарі в реальному часі',
        desc: 'Співпрацюйте безпосередньо в задачах, використовуючи коментарі в реальному часі та згадки.'
      },
      tiptap: {
        title: 'Розширені описи завдань',
        desc: 'Використовуйте редактор Tiptap для розширеного форматування (розмітка, списки, таблиці) в описах завдань.'
      }
    }
  },
  upgrade: {
    title: 'Оновити тарифний план',
    headline: 'Скоро буде'
  },
  plans: {
    title: 'Тарифи',
    cycle: {
      monthly: {
        title: 'Щомісячна оплата',
        per: '/місяць'
      },
      annually: {
        title: 'Щорічна оплата',
        per: '/рік'
      }
    },
    limits: {
      title: 'Ліміти',
      limited: '0 | {count} | До {count} | До {count}',
      unlimited: 'Необмежено',
      workspaces: {
        title: 'Проєкти',
        limited: '0 проєктів | {count} проєкт | До {count} проєктів | До {count} проєктів',
        unlimited: 'Необмежені проєкти',
        boards: {
          title: 'Дошки',
          limited: '0 дошок | {count} дошка | До {count} дошок | До {count} дошок',
          unlimited: 'Необмежені дошки',
          tasks: {
            title: 'Задачі',
            limited: '0 задач | {count} задача | До {count} задач | До {count} задач',
            unlimited: 'Необмежені задачі',
            files: {
              title: 'Закріплених файлів на задачу',
              limited: '0 закріплених файлів на задачу | {count} закріплений файл на задачу | До {count} закріплених файлів на задачу | До {count} закріплених файлів на задачу',
              unlimited: 'Необмежені закріплені файлів на задачу'
            },
            assignees: {
              title: 'Виконавці задач',
              limited: '0 виконавців на задачу | {count} виконавець на задачу | До {count} виконавців на задачу | До {count} виконавців на задачу',
              unlimited: 'Необмежені виконавці задач'
            }
          }
        },
        members: {
          title: 'Участники рабочей області',
          limited: '0 учасників проєкту | {count} учасник проєкту | До {count} учасників проєкту | До {count} учасників проєкту',
          unlimited: 'Необмежені учасники проєкту'
        }
      }
    },
    features: {
      title: 'Функції',
      support: {
        title: 'Підтримка'
      }
    },
    free: {
      name: 'Безкоштовний',
      description: 'Створено для персональних проєктів та інді розробників',
      features: {
        //
      },
      action: 'Почати зараз',
      upgrade: 'План «Команда»',
    },
    team: {
      name: 'Команда',
      description: 'Найкраще підходить для невеликих команд.',
      features: {
        support: 'Базова підтримка'
      },
      action: 'Обрати план',
      upgrade: 'План «Бізнес»'
    },
    business: {
      name: 'Бізнес',
      description: 'Ідеально підходить для великих команд та організацій.',
      features: {
        support: 'Підтримка 24/7'
      },
      action: 'Обрати план',
      upgrade: 'План «Корпоративний»'
    },
    enterprise: {
      name: 'Корпоративний',
      description: 'Ідеально підходить для великих підприємств, складних проєктів та великих команд.',
      features: {
        support: 'Підтримка 24/7'
      },
      action: 'Відділ продажів',
      upgrade: 'Отримати більше'
    }
  },
  dashboard: {
    title: 'Панель керування'
  },
  success: {
    title: 'Успіх!'
  },
  error: {
    title: 'Помилка!',
    500: 'Щось пішло не так 😒'
  },
  user: {
    edit: {
      button: 'Користувач',
      title: 'Редагувати користувача',
      submit: 'Зберегти'
    },
    update: {
      success: {
        description: 'Користувача успішно оновлено.'
      }
    }
  },
  settings: {
    edit: {
      title: 'Налаштування',
      button: 'Налаштування',
      language: 'Мова',
      theme: 'Тема'
    }
  },
  workspaces: {
    create: {
      title: 'Створити проєкт',
      submit: 'Створити',
      success: {
        description: 'Проєкт успішно створено.'
      }
    },
    name: {
      label: 'Назва',
      placeholder: 'Введіть назву проєкту',
      required: 'Назва проєкту обов’язкова'
    },
    description: {
      label: 'Опис',
      placeholder: 'Введіть опис проєкту'
    },
    owner: 'Власник',
    member: 'Учасник',
    members: {
      title: 'Учасники проєкту',
      add: {
        title: 'Додати користувача',
        user: {
          label: 'Користувач',
          placeholder: 'Пошук',
          required: 'Користувач обов’язкове поле'
        },
        role: {
          label: 'Роль',
          placeholder: 'Обрати',
          required: 'Роль обов’язкове поле'
        },
        success: {
          description: 'Учасника проєкту успішно додано'
        }
      },
      remove: {
        button: 'Видалити учасника проєкту',
        title: 'Ви впевнені, що хочете видалити цього учасника проєкту?',
        description: 'Учасника проєкту більше не буде мати доступу в проєкт.',
        submit: 'Так, видалити учасника проєкту',
        success: {
          description: 'Учасника проєкту успішно видалено'
        }
      }
    }
  },
  board: {
    default: {
      1: {
        name: 'Зробити',
        description: 'Задачі, що очікують на початок'
      },
      2: {
        name: 'В процесі',
        description: 'Задачі, що наразі виконуються'
      },
      3: {
        name: 'Виконано',
        description: 'Завершені задачі'
      }
    },
    create: {
      placeholder: 'Створити дошку',
      success: {
        description: 'Дошку успішно створено'
      }
    },
    update: {
      success: {
        description: 'Дошку успішно оновлено'
      }
    },
    delete: {
      button: 'Видалити дошку',
      title: 'Ви впевнені, що хочете видалити цю дошку?',
      description: 'Дошка буде видалена разом із усіма завданнями.',
      submit: 'Так, видалити дошку',
      success: {
        description: 'Дошку успішно видалено'
      }
    }
  },
  task: {
    create: {
      placeholder: 'Створити задачу',
      success: {
        description: 'Задачу успішно створено'
      }
    },
    edit: 'Редагувати задачу',
    update: {
      button: 'Зберегти',
      success: 'Задачу оновлено'
    },
    delete: {
      button: 'Видалити задачу',
      title: 'Ви впевнені, що хочете видалити цю задачу?',
      description: 'Ви не зможете її відновити.',
      submit: 'Так, видалити задачу',
      success: {
        description: 'Задачу успішно видалено'
      }
    },
    404: 'Задачу не знайдено.',
    createdBy: 'Автор',
    createdAt: 'Дата створення',
    assignees: 'Ще немає виконавців | Виконавець | Виконавці | Виконавці',
    assign: {
      button: 'Призначити виконавця',
      search: 'Пошук користувача...'
    },
    name: {
      label: 'Назва',
      required: 'Назва обов’язкова'
    },
    description: {
      label: 'Опис',
      placeholder: 'Почніть друкувати...'
    },
    files: {
      create: {
        label: 'Прикріпити файли',
        max: 'макс.'
      },
      delete: {
        success: {
          description: 'Файл задачі успішно видалено'
        }
      },
      label: 'Прикріплені файли',
      attached: 'Задача має прикріплені файли'
    }
  },
  logout: {
    title: 'Вийти'
  }
}
